Autodesk.Revit.DB.IExternalResourceServerProxy.GetInformationLink
The method that Revit will invoke to obtain a URL address which provides more information about the server.
Returns:
The URL providing server information.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.GetTypeSpecificServerOperations(Autodesk.Revit.DB.ExternalResourceServerExtensions)
Implement this method to get operations supported by the external server for a particular type of external resource.
Remarks:
Through this method, some specific operations for a paritcular type of external resource, such as Open(and Unload)
and shared coordinates for Revit Link, can be set in a class ExternalResourceServerExtensions.
ExternalResourceServerExtensions is able to own sub-interface classes, each of which has methods
related to a particular type of external resource.
extensions:
The class which owns sub-interface classes, each of which has methods related to a particular type of external resource.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.GetShortName
Implement this method to return the short name of the server.
Remarks:
The name is a unique path prefix included in full paths to external resources provided by this server.
It is recommended that the short name length is at least 3 characters to make it useful for
users to identify the server easily.
To ensure the server can be registered successfully, the name should match restrictions below:The name cannot be empty or consist of only whitespace characters.The name should not include any invalid characters such as \/:*?"<>|.The name cannot duplicate any other external resource server names.The name should not duplicate a Revit reserved path prefix(case insensitive), including:
RSN, A360, buzzsaw, vault, redspark, ftp, http, https, files, file.
Returns:
The short name of the server.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.GetIconPath
Implement this method to return the path to an icon file which will be displayed in Revit
user interfaces associated to this server.
Remarks:
The specified image will be displayed in the browser dialogs when the user is selecting
a resource of a compatible type.
The return must be the full path to an icon file containing 48x48, 32x32 and 16x16 pixel images.
If this method returns anything other than a valid icon file, a default image will be used for the server.
Returns:
The image file of the server.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.SetupBrowserData(Autodesk.Revit.DB.ExternalResourceBrowserData)
Implement this method to setup external resource browser data which will be accessed in Revit external resource browser UI.
Remarks:
If errors occur during setup, store this information externally, and then retrieve and deal
with the errors during the call to HandleBrowseResult() of your IExternalResourceUIServer.
browseData:
The input context to match the external resources and browser results returned by the server.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.AreSameResources(System.Collections.Generic.IDictionary{System.String,System.String},System.Collections.Generic.IDictionary{System.String,System.String})
Implement this method to indicate whether two given resources are the same.
Returns:
True if two given resources are the same; otherwise false.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.GetResourceVersionStatus(Autodesk.Revit.DB.ExternalResourceReference)
Implement this method to indicate whether the given version of a resource is the most
current version of the data.
Remarks:
If Revit already has a version of this resource loaded, Revit will invoke this method
to check whether the resource's data will change if Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent) is called.  If this method
returns ResourceVersionStatus.Current, then Revit will improve model performance
by not calling Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent).
Note that this method may also be invoked to determine the behavior of certain
elements within the user interface.  For example, it may be used to warn the user if they
are about to execute certain expensive operations (such as printing) with an outdated
version of this resource.
Servers which encounter errors should return ResourceVersionStatus.Unknown. Revit
will reload resources whose version status is unknown, but will not display
out-of-date warnings to the user on printing.
reference:
The ExternalResourceReference to check.
Returns:
An enum indicating whether the resource is current, out of date, or of unknown status.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.GetInSessionPath(Autodesk.Revit.DB.ExternalResourceReference,System.String)
Implement this method to provide the path that should be used for display and browsing to a given ExternalResourceReference
during this Revit session.
Remarks:
This method allows an IExternalResourceServer to override the path that is used within this Revit
session to display and browse to a specific ExternalResourceReference.  This method is provided
to accommodate IExternalResourceServers that may present different paths under different circumstances.
For example, an IExternalResourceServer might implement this method to return a display path
that uses the appropriate language for the user's current locale.  An IExternalResourceServer
could also use this method to present the appropriate name if the user has renamed this
resource since the last time it was loaded.  If the IExternalResourceServer does not need to
customize the display path, it can return the originalDisplayPath parameter.
Revit will invoke this method when the model is first loaded or before calling Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent)
and cache the result in the ExternalResourceReference.
reference:
The ExternalResourceReference for which Revit is requesting the in session display path.
originalDisplayPath:
The path that was provided for the resource when the resource was originally loaded into the model.
Returns:
The display path that should be used for this resource for this session of Revit.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.IsResourceWellFormed(Autodesk.Revit.DB.ExternalResourceReference)
Implement this method to check whether the given ExternalResourceReference is formatted
correctly for this server.
Remarks:
Different servers will have different requirements.
A server which loads references from a website might
require that the reference map contain a key called "URL"
and a value that is a valid URL.
A server which loads references from a network drive
might require a key called "Drive" with a value that
represents a drive name, plus a key called "Path" with
a value that corresponds to a path relative to the root
of the drive.
This function should not check that the resource exists
on the server. It should only check that the resource is
formatted correctly.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference represents a well-formed
resource. False otherwise.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent)
Implement this method to load the requested resource.
Remarks:
This method will be invoked when Revit needs to load a resource supplied by this server.
Revit provides four key pieces of information to the server:
A GUID identifying the load request.
The type of external resource that Revit is requesting, such as keynote data, linked Revit/CAD files, etc.
An ExternalResourceReference object, which contains information, such as a filename, the version, or other data,
that identifies the specific resource that Revit needs from the server.
An ExternalResourceLoadContext object, which contains information about the context of the load request. For
example, the ExternalResourceLoadContext contains information describing whether the load came about as a result of
a user action or an automatic action.
The server returns the results of the load request back to Revit via the loadResults argument, which will be a
sub-class of ExternalResourceLoadContent.  This object will contain appropriate data structures to hold the actual resource
data (content) required by Revit for the specified ExternalResourceType.
Server authors may also wish to display UI related to the resource load operation, particularly when errors occur while
loading or creating the content.  The UI should not be created by the IExternalResourceServer.  Instead, the server
author should implement an IExternalResourcesUIServer which will handle all UI-related tasks.  The external services framework
supports data sharing between, and coordinates the actions of, the two types of servers as follows:
Each ExternalResourceLoadContent sub-class is designed to hold data related to errors that may have occurred while
loading or creating the content the specified ExternalResourceType.  The IExternalResourceServer should set this data as
needed in the Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent) method.
The error data, along with ExternalResourceReference and other information associated with the attempt to load the external
resource, is stored internally by Revit until a time when it is appropriate to display UI.
When appropriate, the framework will invoke the HandleLoadResourceResults method of any IExternalResourceUIServer
that is associated with the IExternalResourceServer, and will pass the error data and other information to the UIServer
for possible display in the Revit UI.
Note that instead of using the ExternalResourceLoadContent object, the IExternalResourceServer can store its own error
information.  Subsequently, when the external services framework invokes the IExternalResourceUIServer's HandleLoadResourceResults
method, the IExternalResourceUIServer can communicate directly with its associated IExternalResourceServer - using whatever interface
the server developer has implemented - to retrieve the required messages and error data for display in the UI. Revit provides
a GUID to Autodesk.Revit.DB.IExternalResourceServerProxy.LoadResource(System.Guid,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ExternalResourceLoadContext,Autodesk.Revit.DB.ExternalResourceLoadContent), to facilitate identification of individual load requests.
loadRequestId:
The id uniquely identifying the load request.
resourceType:
The type of resource requested.
desiredResource:
The specific resource that should be loaded.
loadContext:
A class containing info about the context of the load request.
loadResults:
The data returned by the server as a result of this load operation.
Revit will ensure that this argument is the appropriate subclass of ExternalResourceLoadContent for the type of data.
Since:
2015

Autodesk.Revit.DB.IExternalResourceServerProxy.SupportsExternalResourceType(Autodesk.Revit.DB.ExternalResourceType)
Implement this method to indicate whether the server can provide data for a specified type of external resource.
type:
The ExternalResourceType of interest to the caller.  For example, KeynoteTable - to determine
if the server provides data for Revit's keynote table.
Returns:
True if the server supports the specified type of external resource
Since:
2015